# SetSelectionFilter Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudInstance..::..SetSelectionFilter Method
PointCloudInstance Class See Also
---
Sets active selection filter by cloning of the one passed to it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetSelectionFilter(
	PointCloudFilter pFilter
)
```

Visual Basic
---
```text
Public Sub SetSelectionFilter ( _
	pFilter As PointCloudFilter _
)
```

Visual C++
---
```text
public:
void SetSelectionFilter(
	PointCloudFilter^ pFilter
)
```

# ### Parameters
pFilter
    Type: Autodesk.Revit.DB.PointClouds..::..PointCloudFilter The filter object to be made active. If nullNothingnullptra null reference (Nothing in Visual Basic) is supplied, the active filter is removed.
# Remarks
The filter is provided in the coordinates of the Revit model. If the point cloud is altered (e.g. by moving, rotating, scaling or other modifications) the point cloud filter is not modified and the set of highlighted or isolated points will change. The selection filter is not preserved when the Revit document is saved.
# See Also
PointCloudInstance Class
Autodesk.Revit.DB Namespace